dimitrioskyranos/ee3-code/ESP32_Code/C_Code/latest/esp-interrupts/src/main.c
    // Adjust last position gradually
    *lastPos += step;

    // Clamp the position within allowed servo limits
    if (*lastPos < min) *lastPos = min;
    if (*lastPos > max) *lastPos = max;

    // Set the duty cycle for the servo
    ledc_set_duty(LEDC_LOW_SPEED_MODE, servo_channel, *lastPos);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, servo_channel);
}


void control_motors(uint8_t x, uint8_t y) {
    int speedA = 0;
    int speedB = 0;
    bool forwardA = true;
    bool forwardB = true;

    // // Forward/Backward logic
    // if (y < 0x80) {
    //     // Joystick Up: Both motors move forward
    //     speedA = (0x80 - y) * 2; // Speed increases as y decreases
    //     speedB = (0x80 - y) * 2;
    //     forwardA = true;
    //     forwardB = true;
    // } else if (y > 0x80) {
    //     // Joystick Down: Both motors move backward
    //     speedA = (y - 0x80) * 2; // Speed increases as y increases
    //     speedB = (y - 0x80) * 2;
    //     forwardA = false;
    //     forwardB = false;
    // }

    // // Left/Right logic
    // if (x < 0x80) {
    //     // Joystick Left: Only Motor B moves forward
    //     speedA = 0; // Motor A is stopped
    //     speedB = (0x80 - x) * 2; // Speed increases as x decreases
    //     forwardA = true; // Doesn't matter since speedA is 0
    //     forwardB = true;
    // } else if (x > 0x80) {
    //     // Joystick Right: Only Motor A moves forward
    //     speedA = (x - 0x80) * 2; // Speed increases as x increases
    //     speedB = 0; // Motor B is stopped
    //     forwardA = true;
    //     forwardB = true; // Doesn't matter since speedB is 0
    // }

    // // Ensure the speeds are within the valid range
    // speedA = (speedA < 0) ? 0 : (speedA > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedA;
    // speedB = (speedB < 0) ? 0 : (speedB > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedB;

    

    // // Set the motor speeds and directions
    // set_motorA(forwardA, speedA);
    // set_motorB(forwardB, speedB);



    if(y < 0x80 && x > 0x80){
        speedA = sqrt(pow((y - 0x80)*16, 2) + pow((x-0x80)*16, 2));
        speedB = (y - 0x80) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y < 0x80 && x < 0x80){
        speedA = (y - 0x80) * 16;
        speedB = sqrt(pow((y - 0x80)*16, 2) + pow((x-0x80)*16, 2));
        forwardA = false;
        forwardB = false;
       } else if(y > 0x80 && x < 0x80 ){
        speedA = sqrt(pow((0x80 - y)*16,2) + pow((x-0x80)*16,2));
        speedB = (120 - y) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y > 0x80 && x > 0x80){
        speedA = (0x80 - y) * 16;
        speedB = sqrt(pow((0x80 - y)*16,2) + pow((x-0x80)*16,2));
        forwardA = true;
        forwardB = true;
       } else if(y > 0x80){
        speedA = (y - 0x80) * 16;
        speedB = (y - 0x80) * 16;
        forwardA = true;
        forwardB = true;
       } else if(y < 0x80){
        speedA = (0x80 - y) * 16;
        speedB = (0x80 - y) * 16;
        forwardA = false;
        forwardB = false;
       } else {
        speedA = 0;
        speedB = 0;
        forwardA = true;
        forwardB = true;
       }

           // // Ensure the speeds are within the valid range
     speedA = (speedA < 0) ? 0 : (speedA > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedA;
     speedB = (speedB < 0) ? 0 : (speedB > MAX_DUTY_CYCLE) ? MAX_DUTY_CYCLE : speedB;

    

     // Set the motor speeds and directions
     set_motorA(forwardA, speedA);
     set_motorB(forwardB, speedB);

}

void handle_nrf_data() {
    if (isDataAvailable(1) == 1) {
        NRF24_Receive(RxData);

        // Parse received data
        uint8_t joystickY = RxData[1];
        uint8_t joystickX = RxData[0];
        uint8_t servoX = RxData[2];
        uint8_t servoY = RxData[3];
        uint8_t servoSwitch = RxData[4];
        uint8_t grabButton = RxData[5];

        // Process movement
        control_motors(joystickX, joystickY);

        // Process servo movement
        control_servo(servoX, SERVO_X_CHANNEL);
        control_servo(servoY, SERVO_Y_CHANNEL);
        control_servo_toggle(servoSwitch, SERVO_Z_CHANNEL);
        control_servo_toggle_grab(grabButton, SERVO_G_CHANNEL);

        // Handle siren
        // switch_pressed = (gpio_get_level(SWITCH_PIN) == 0);  // LOW = pressed
        bool car_moving = (joystickX != 0x80 || joystickY != 0x80);
        siren_active = switch_pressed && car_moving;
    //     if (siren_active){
    //         ESP_LOGI(TAG,"Siren Active");
    //     }

    //     // Optional logging
       ESP_LOGI(TAG, "Joystick X: %d, Y: %d", joystickX, joystickY);
    //    ESP_LOGI(TAG, "Servo X: %d, Y: %d", servoX, servoY);
    }
}

void IRAM_ATTR nrf_irq_handler(void* arg) {
    irq_triggered = true;  // Set flag

}

void nrf_timer_callback(TimerHandle_t xTimer) {
    timer_ready = true;
}


void siren_timer_callback(TimerHandle_t xTimer) {
    siren_tick = true;
}   


void siren_task(void *arg) {
    uint32_t current_freq = SPEAKER_FREQ1;

    while (1) {
        if (siren_tick) {
            siren_tick = false;

            if (siren_active) {
                // Toggle frequency
                current_freq = (current_freq == SPEAKER_FREQ1) ? SPEAKER_FREQ2 : SPEAKER_FREQ1;
                ESP_LOGI(TAG,"Current f: %ld",current_freq);
                ledc_set_freq(LEDC_LOW_SPEED_MODE, LEDC_TIMER_2, current_freq);
                ledc_set_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL, SPEAKER_DUTY);
                ledc_update_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL);
            } else {
                ledc_set_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL, 0);
                ledc_update_duty(LEDC_LOW_SPEED_MODE, SPEAKER_CHANNEL);
            }
        }
        // No delay here — the task just yields
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}


void check_switch_toggle()
{
    static bool last_switch_state = true;  // true = HIGH (unpressed), false = LOW (pressed)

    bool current_state = gpio_get_level(SWITCH_PIN);  // true if unpressed (pull-up enabled)

    // Detect transition from HIGH -> LOW (button press)
    if (!current_state && last_switch_state)
    {
        switch_pressed = !switch_pressed;  // Toggle siren state
        ESP_LOGI(TAG, "Toggled switch: %s", switch_pressed ? "ON" : "OFF");
    }

    last_switch_state = current_state;  // Save for next comparison
}

